Repository: isrealolalere/schoolwebsite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: English
fr: Anglais

source: French
fr: Français

source: About Us
fr: À Propos De Nous

source: Change Language
fr: Changer la Langue

source: At our school, we believe in nurturing young minds from an early age, which is why our creche program offers a safe and stimulating environment for infants and toddlers. Our experienced and caring staff create a nurturing atmosphere that promotes early learning, social skills, and emotional development, setting the foundation for a successful educational journey.
fr: Dans notre école, nous croyons en l'épanouissement des jeunes esprits dès leur plus jeune âge, c'est pourquoi notre programme de crèche offre un environnement sûr et stimulant pour les nourrissons et les tout-petits. Notre personnel expérimenté et attentionné crée une atmosphère bienveillante qui favorise l'apprentissage précoce, les compétences sociales et le développement émotionnel, posant ainsi les bases d'un parcours éducatif réussi.

source: For children in grades 1 to 6, we provide a comprehensive primary school program that focuses on academic excellence, character development, and personal growth. Our dedicated teachers employ innovative teaching methods, interactive activities, and a well-rounded curriculum to ensure that every child receives a well-rounded education. We strive to create a supportive and inclusive community where students feel valued and inspired to reach their full potential.
fr: Pour les enfants de la 1ère à la 6ème année, nous offrons un programme scolaire primaire complet axé sur l'excellence académique, le développement du caractère et la croissance personnelle. Nos enseignants dévoués utilisent des méthodes pédagogiques novatrices, des activités interactives et un curriculum complet pour s'assurer que chaque enfant reçoive une éducation complète. Nous nous efforçons de créer une communauté solidaire et inclusive où les élèves se sentent valorisés et inspirés à atteindre leur plein potentiel.

source: In addition to our primary school programs, we offer online adult classes designed to meet the needs of lifelong learners. Whether you're looking to enhance your professional skills or pursue personal interests, our experienced instructors provide engaging and flexible learning opportunities. With our online adult classes, you can expand your knowledge, acquire new skills, and stay ahead in today's fast-paced world.
fr: En plus de nos programmes scolaires primaires, nous proposons des cours pour adultes en ligne conçus pour répondre aux besoins des apprenants tout au long de la vie. Que vous cherchiez à améliorer vos compétences professionnelles ou à poursuivre des intérêts personnels, nos instructeurs expérimentés offrent des opportunités d'apprentissage engageantes et flexibles. Avec nos cours pour adultes en ligne, vous pouvez élargir vos connaissances, acquérir de nouvelles compétences et rester en avance dans le monde d'aujourd'hui en constante évolution.

source: We invite you to explore our website to learn more about our programs, faculty, facilities, and the many opportunities we offer for educational and personal growth. Join us at our school, where learning is a lifelong journey, and together, we can shape a brighter future for our students and our society. Welcome to a place where educational excellence meets limitless possibilities.
fr: Nous vous invitons à explorer notre site Web pour en savoir plus sur nos programmes, notre corps enseignant, nos installations et les nombreuses opportunités que nous offrons pour la croissance éducative et personnelle. Rejoignez-nous dans notre école, où l'apprentissage est un voyage tout au long de la vie, et ensemble, nous pouvons façonner un avenir plus radieux pour nos élèves et notre société. Bienvenue dans un endroit où l'excellence éducative rencontre des possibilités illimitées.

source: STUDENT INFORMATION
fr: INFORMATION DE L'ÉTUDIANT

source: Preview Image
fr: Image de Prévisualisation

source: STUDENT ADDRESS
fr: ADRESSE DE L'ÉTUDIANT

source: PARENT INFORMATION
fr: INFORMATIONS SUR LES PARENTS

source: PARENT NAMES
fr: NOMS DES PARENTS

source: PARENT ADDRESS
fr: ADRESSE DES PARENTS

source: PARENT CONTACT
fr: CONTACT DES PARENTS

source: Finalize registration
fr: Finaliser l'inscription

source: Welcome to King's Heart Bilingual School
fr: Bienvenue à l'École Bilingue King's Heart

source: Building genius since 2008
fr: Construire le génie depuis 2008

source: Behind former delegate adissa house, Oke-Ola, Pobe, Federal Republic of Benin
fr: Derrière l'ancienne maison du délégué Adissa, Oke-Ola, Pobe, République du Bénin

source: Home - KHBS
fr: Accueil - KHBS

source: Our Mission
fr: Notre Mission

source: To build sound, confident and moral upright achievers that will be a reference anywhere in the world
fr: Construire des réussites solides, confiantes et moralement intègres qui seront une référence partout dans le monde

source: Our vision
fr: Notre vision

source: To be a world-class institution providing qualitative education to our stakeholders which makes them become second to none individual in any area of their endeavors
fr: Être une institution de classe mondiale offrant une éducation qualitative à nos parties prenantes, ce qui les rend inégalées dans n'importe quel domaine de leurs entreprises

source: Our programs
fr: Nos programmes

source: Admission into creche, class 1-6, Online adult class, Common enterance, WAEC registeration
fr: Admission en crèche, classes de 1 à 6, cours pour adultes en ligne, examen d'entrée commun, inscription au WAEC

source: Founded in 2008, our school is a leading institution dedicated to providing top-quality education and fostering holistic development for children and adults alike. From our creche and primary school programs to our online adult classes, we are committed to empowering individuals to excel in all areas of their endeavors...
fr: Fondée en 2008, notre école est une institution de premier plan dédiée à la fourniture d'une éducation de haute qualité et à la promotion du développement holistique des enfants et des adultes. De nos programmes de crèche et d'école primaire à nos cours en ligne pour adultes, nous nous engageons à habiliter les individus à exceller dans tous les domaines de leurs entreprises...

source: Read more about us
fr: En savoir plus sur nous

source: Events
fr: Événements

source: Our Admissions
fr: Nos Admissions

source: Admission for
fr: Admission pour

source: is open into
fr: est ouverte pour

source: Creche
fr: Crèche

source: At our creche, we provide a nurturing and safe environment for infants and toddlers, ensuring their early years are filled with love, care, and learning. Our experienced and dedicated staff members understand the unique needs of young children and strive to create a warm and welcoming atmosphere.
fr: Dans notre crèche, nous offrons un environnement d'épanouissement et de sécurité aux nourrissons et aux tout-petits, en veillant à ce que leurs premières années soient remplies d'amour, de soins et d'apprentissage. Nos membres du personnel expérimentés et dévoués comprennent les besoins uniques des jeunes enfants et s'efforcent de créer une atmosphère chaleureuse et accueillante.

source: Nursery
fr: École Maternelle

source: Our nursery section is designed to provide a seamless transition from the creche to a more structured learning environment. We understand that each child is unique and has their own pace of development. Our nurturing teachers create an inclusive and engaging atmosphere where children can thrive and flourish.
fr: Notre section de l'école maternelle est conçue pour assurer une transition en douceur de la crèche à un environnement d'apprentissage plus structuré. Nous comprenons que chaque enfant est unique et a son propre rythme de développement. Nos enseignants bienveillants créent une atmosphère inclusive et engageante où les enfants peuvent s'épanouir.

source: Primary
fr: École Primaire

source: Our primary section lays the foundation for lifelong learning and prepares students for a successful academic journey. We create a stimulating learning environment that encourages critical thinking, collaboration, and a passion for knowledge. Our dedicated teachers instill a love for learning and empower students to become confident, compassionate, and responsible individuals.
fr: Notre section de l'école primaire pose les bases de l'apprentissage tout au long de la vie et prépare les élèves à un parcours académique réussi. Nous créons un environnement d'apprentissage stimulant qui encourage la pensée critique, la collaboration et la passion pour la connaissance. Nos enseignants dévoués insufflent l'amour de l'apprentissage et responsabilisent les élèves pour qu'ils deviennent des individus confiants, compatissants et responsables.

source: Click Here To Register Your Child Today
fr: Cliquez ici pour inscrire votre enfant dès aujourd'hui

source: KHBS LOGO
fr: KHBS

source: Home
fr: Accueil

source: Register
fr: Inscription
